; Arabic
; Ayad Seghairi

[Arabic]
IDS_UPDATE_NO=لا يوجد تحديثات متاحة.
IDS_UPDATE_YES=هنالك تحديث متاح، هل تريد تنزيله؟
IDS_FILE=ملف
IDS_SETTINGS=الإعدادات
IDS_EXIT=خروج
IDS_LANGUAGE=لغة
IDS_HELP=مساعدة
IDS_WEBSITE=موقع الويب
IDS_CHECKUPDATES=تحقق من وجود تحديثات
IDS_ABOUT=حول البرنامج
IDS_DONATE=تبرع
IDS_TRAY_SHOW=إظهار / إخفاء
IDS_TRAY_DISABLE=تعطيل
IDS_TRAY_POPUP_1=مناطق نظيفة
IDS_TRAY_POPUP_2=نظف عندما يكون أكبر من
IDS_TRAY_POPUP_3=نظف الكل
IDS_CLEAN=محو الذاكرة
IDS_GROUP_1=ذاكرة فعلية
IDS_GROUP_2=الذاكرة الظاهرية
IDS_GROUP_3=ذاكرة التخزين المؤقت للنظام
IDS_ITEM_1=الإستعمال
IDS_ITEM_2=متاح
IDS_ITEM_3=إجمالي المتاح
IDS_SETTINGS_GENERAL=عام
IDS_SETTINGS_MEMORY=تنظيف الذاكرة
IDS_SETTINGS_APPEARANCE=المظهر
IDS_SETTINGS_TRAY=رمز الإعلام
IDS_CLOSE=إغلاق
IDS_TITLE_1=الإعداد العام
IDS_TITLE_2=إعادة تعيين
IDS_TITLE_3=مناطق الذاكرة التي يمكن تنظيفها
IDS_TITLE_4=إدارة الذاكرة
IDS_TITLE_5=اختصارات لوحة المفاتيح (عمومية)
IDS_TITLE_6=نمط
IDS_TITLE_7=مؤشرات اللون
IDS_TITLE_8=التحكم بالماوس
IDS_TITLE_9=تلميحات الأدوات
IDS_ALWAYSONTOP_CHK=مرئي دائما
IDS_LOADONSTARTUP_CHK=بدء التشغيل عند بدء تشغيل النظام
IDS_STARTMINIMIZED_CHK=إطلاق في الوضع المصغر
IDS_REDUCTCONFIRMATION_CHK=تأكيد جمع القمامة
IDS_SKIPUACWARNING_CHK=تجاهل تحذير التحكم في حساب المستخدم
IDS_CHECKUPDATES_CHK=تحقق بانتظام من التحديثات (مستحسن)
IDS_LANGUAGE_HINT=إختيار اللغة:
IDS_WORKINGSET_CHK=工作集
IDS_SYSTEMWORKINGSET_CHK=系统文件缓存
IDS_STANDBYLISTPRIORITY0_CHK=备用列表（无优先级）
IDS_STANDBYLIST_CHK=备用列表*
IDS_MODIFIEDLIST_CHK=已修改页列表*
IDS_COMBINEMEMORYLISTS_CHK=合并内存列表 (Win10+)
IDS_AUTOREDUCTENABLE_CHK=تنظيف عندما تكون أكبر من: (٪)
IDS_AUTOREDUCTINTERVALENABLE_CHK=تنظيف كل: (دقيقة)
IDS_HOTKEY_CLEAN_CHK=مسح الذاكرة:
IDS_TRAYUSETRANSPARENCY_CHK=إستخدم خلفية شفافة
IDS_TRAYSHOWBORDER_CHK=إظهار الحدود
IDS_TRAYROUNDCORNERS_CHK=زوايا دائرية
IDS_TRAYCHANGEBG_CHK=تغيير لون الخلفية (بدلًا من النص والحدود)
IDS_TRAYUSEANTIALIASING_CHK=استخدام الصقل
IDS_FONT_HINT=الخط:
IDS_COLOR_TEXT_HINT=لون النص
IDS_COLOR_BACKGROUND_HINT=لون الخلفية
IDS_COLOR_WARNING_HINT=لون المستوى "الحرج"
IDS_COLOR_DANGER_HINT=لون مستوى "الخطر"
IDS_TRAYLEVELWARNING_HINT="عتبة التنبيه" تبدأ عند: (٪)
IDS_TRAYLEVELDANGER_HINT="عتبة الخطر" تبدأ من: (٪)
IDS_TRAYACTIONSC_HINT=Single click:
IDS_TRAYACTIONMC_HINT=نقرة عجلة:
IDS_TRAY_ACTION_1=إظهار / إخفاء
IDS_TRAY_ACTION_2=محو الذاكرة
IDS_TRAY_ACTION_3=فتح مدير المهام
IDS_SHOW_CLEAN_RESULT_CHK=إظهار نتائج جمع القمامة
IDS_QUESTION=هل أنت متأكد أنك تريد تنظيف الذاكرة؟
IDS_QUESTION_WARNING=التبديل بين "قائمة الانتظار" و "قائمة الصفحات المعدلة" يمكن أن يجمد جهاز الكمبيوتر الخاص بك لمدة دقيقة تقريبًا
IDS_QUESTION_FLAG_CHK=لا تظهر مرة أخرى
IDS_STATUS_CLEANED=تم تنظيف الذاكرة: تم تحرير٪ s.
IDS_STATUS_NOPRIVILEGES=حقوق المسؤول مطلوبة: الرجاء إعادة تشغيل التطبيق كمسؤول!
IDS_UPDATE_DOWNLOAD=يتم تنزيل التحديث...
IDS_UPDATE_DONE=إنتهى تنزيل التحديث.
IDS_UPDATE_ERROR=حدث خطأ اثناء الإتصال بالخادم.
IDS_UPDATE_INIT=يتم فحص إذا كان هنالك إصدارات جديدة...
IDS_UPDATE_INSTALL=تحديث متاح، هل تريد تنزيله؟
IDS_RESET=إعادة تعيين
IDS_QUESTION_RESET=هل أنت متأكد أنك تريد إعادة ضبط كل الإعدادات؟
IDS_NOTIFICATIONSOUND_CHK=تفعيل الإخطارات الصوتية
IDS_TITLE_ADVANCED=متقدم
IDS_VIEW=معاينة
IDS_USEDARKTHEME=استخدم المظهر الداكن
IDS_UPDATE_SPEED=Speed
IDS_TITLE_10=上次清理状态
IDS_CLEANUP_STATUS_OK=成功
IDS_CLEANUP_STATUS_FAIL=失败 (0x%08X)
IDS_CLEANUP_STATUS_SKIP=已跳过（系统不支持）
IDS_CLEANUP_STATUS_NONE=未执行
IDS_MODIFIEDFILECACHE_CHK=已修改文件缓存
IDS_REGISTRYCACHE_CHK=注册表缓存 (Win8.1+)
IDS_ALLOWSTANDBYLISTCLEANUP_CHK=允许在自动清理时清理“备用列表”和“已修改页列表”
IDS_LOGRESULTS_CHK=将清理结果记录到调试日志
IDS_LANGUAGE_SECTION_HINT=（语言）
IDS_LANGUAGE_MENU_FORMAT=%s（语言）
IDS_REGION_UNKNOWN=未知
IDS_CMDLINE_HELP_TITLE=memreduct.exe 可用选项：
IDS_CMDLINE_HELP_BODY=-clean - 清理默认内存区域\r\n-clean:full - 清理全部内存区域
IDS_CLEANUP_REASON_AUTO=清理（自动）
IDS_CLEANUP_REASON_MANUAL=清理（手动）
IDS_CLEANUP_REASON_HOTKEY=清理（快捷键）
IDS_CLEANUP_REASON_CMDLINE=清理（命令行）
IDS_TRAY_INTERVAL_ITEM=%lld 分钟
IDS_REGIONS_HELP_TITLE=内存区域清理说明
IDS_REGIONS_HELP_BODY=【前提】清理内存需要管理员权限；未提权时无法更改选项或执行清理。\r\n\r\n【各选项含义与影响】\r\n• 工作集：回收各进程近期未使用的物理内存。影响较小，适合日常使用。\r\n• 系统文件缓存：释放系统用于加速读盘的文件缓存。可能短暂增加磁盘读取，通常可接受。\r\n• 备用列表（无优先级）：清理低优先级待机页，收益与风险较均衡。\r\n• 已修改文件缓存：释放已修改但仍驻留内存的文件数据，中等影响。\r\n• 注册表缓存 (Win8.1+)：清理注册表相关缓存，需较新系统。\r\n• 合并内存列表 (Win10+)：合并相似内存页以节省空间，影响因系统负载而异。\r\n• 备用列表* / 已修改页列表*：清理范围更大，可能造成数秒至约一分钟无响应；内存并不紧张时收益有限、副作用更明显。\r\n\r\n【手动 vs 自动】\r\n• 手动清理：按当前勾选项执行，带*项也可勾选。\r\n• 自动/定时/快捷键：默认会排除带*项；仅在「高级」中启用“允许在自动清理时清理备用列表和已修改页列表”后，自动清理才会包含它们。\r\n\r\n【使用建议】\r\n• 日常办公/浏览：保持默认勾选项即可，内存占用偏高时再手动清理。\r\n• 游戏/直播/剪辑：避免在运行大型程序时清理；不要启用带*项；优先关闭不用的程序。\r\n• 内存已充足（约低于 70%）：频繁清理意义不大，可能增加磁盘 IO。\r\n• 内存紧张（约高于 85%）：可先清理默认项；仍慎用带*项。\r\n\r\n带*项首次启用时程序会额外提示确认，请仔细阅读后再决定。
